      * Sample COBOL Program
      * Copyright (c) 2026 Mecanik Dev. All rights reserved.
      * See LICENSE file for terms of use.
        IDENTIFICATION DIVISION.
        PROGRAM-ID. PRG1.
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        PROCEDURE DIVISION.
               DISPLAY "HELLO WORLD!".
               STOP RUN.
